tap "zfdang/free-for-macos"

brew "mas"
brew "bat"
brew "lsd"
brew "direnv"
brew "dnscrypt-proxy", restart_service: true
brew "dust"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "ghq"
brew "git-delta"
brew "jq"
brew "efm-langserver"
brew "tree"
brew "tree-sitter"
brew "neovim"
brew "ripgrep"
brew "sheldon"
brew "tailspin"
brew "tmux"
brew "zfdang/free-for-macos/free-for-macos"
brew "mise"
brew "uv"

cask "rectangle"
cask "secretive"
cask "logi-options+"
cask "karabiner-elements"
cask "azookey"
cask "google-chrome"
cask "google-drive"
cask "notion"
cask "notion-calendar"
cask "thebrowsercompany-dia"
cask "visual-studio-code"
cask "figma"
cask "ghostty"
cask "keepassxc"

mas "LINE", id: 539883307
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "UpNote", id:1398373917
mas "iMovie", id:408981434
mas "Windows App", id:1295203466
mas "Messenger", id:1480068668
mas "Keynote", id:409183694
mas "Kindle", id:302584613
mas "Pages", id:409201541
mas "Tailscale", id:1475387142
mas "Hand Mirror", id:1502839586
mas "Dropover", id:1355679052
